docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-30 vi. 18:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>solaR2: Solar Radiation and Photovoltaic Systems with R 2</title>
<meta name="author" content="Francisco Delgado López" />
<meta name="description" content="solaR2" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">solaR2: Solar Radiation and Photovoltaic Systems with R 2</h1>

<div id="outline-container-org141abb2" class="outline-2">
<h2 id="org141abb2">Introduction</h2>
<div class="outline-text-2" id="text-org141abb2">
<p>
The <code>solaR2</code> package allows for reproducible research both for photovoltaics (PV) systems performance and solar radiation. It includes a set of classes, methods, and functions to calculate the sun geometry and the solar radiation incident on a photovoltaic generator, as well as to simulate the performance of various photovoltaic energy applications. This package performs the entire calculation procedure from both daily and intradaily global horizontal irradiation to the final productivity of grid-connected PV systems and water pumping PV systems.
</p>

<p>
It is designed using a set of S4 classes that handle multivariate time series efficiently and are optimized for high-performance data manipulation. The classes share a variety of methods to access the information and several visualization methods. Additionally, the package provides tools for the visual statistical analysis of the performance of large PV plants composed of multiple systems.
</p>

<p>
Although <code>solaR2</code> is primarily designed for time series associated with a location defined by its latitude/longitude values and temperature and irradiation conditions, it can be easily combined with spatial packages for space-time analysis.
</p>
</div>
</div>

<div id="outline-container-org2ed79d0" class="outline-2">
<h2 id="org2ed79d0">Software</h2>
<div class="outline-text-2" id="text-org2ed79d0">
<p>
The stable version of <code>solaR2</code> is hosted at <a href="https://cran.r-project.org/package=solaR">CRAN</a>. 
The development version is available at <a href="https://github.com/solarization/solaR2">GitHub</a>.
</p>
</div>
</div>

<div id="outline-container-orgbbdfbb7" class="outline-2">
<h2 id="orgbbdfbb7">Citation</h2>
<div class="outline-text-2" id="text-orgbbdfbb7">
<p>
If you use <code>solaR2</code>, please cite it in any publication reporting
results obtained with this software:
</p>

<div class="org-src-container">
<pre class="src src-verbatim">Delgado López, Francisco y Perpiñán Lamigueiro, Oscar (2024).
solaR2: Radiation and Photovoltaic Systems with R version 2.
R package version 0.10.
Disponible en: https://github.com/solarization/solaR2
</pre>
</div>

<p>
A BibTeX entry for LaTeX users is
</p>
<div class="org-src-container">
<pre class="src src-verbatim">@Manual{solaR2,
  title     = {solaR2: Radiation and Photovoltaic Systems with R version 2},
  author    = {Francisco Delgado and Oscar Perpiñán Lamigueiro},
  year      = {2024},
  url       = {https://github.com/solarization/solaR2},
  note      = {R package version 0.10},
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Francisco Delgado López</p>
<p class="date">Created: 2024-08-30 vi. 18:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
